Revit 2027 API
HVACLoadBuildingType.UnoccupiedCoolingSetPoint Property
 The unoccupied cooling set point of the building type with unit kelvin (K).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double UnoccupiedCoolingSetPoint { get; set; }
Public Property UnoccupiedCoolingSetPoint As Double
	Get
	Set
public:
property double UnoccupiedCoolingSetPoint {
	double get ();
	void set (double value);
}
member UnoccupiedCoolingSetPoint : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The value should be between (273.15, 373.15] with unit kelvin (K).
See Also
Reference
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace